lo22/angle_30_slope_proc4_modelHB_turbRAS_3.0.1_hex_orthohonal_origin/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water air);

water
{
	transportModel HerschelBulkley; 
    rho             rho [ 1 -3 0 0 0 0 0 ] 200;
	HerschelBulkleyCoeffs 
	{ 
		nu0             nu0   [ 0 2 -1 0 0 0 0 ] 1e4; 
		tau0            tau0  [ 0 2 -2 0 0 0 0 ] 14; 
		k               k     [ 0 2 -1 0 0 0 0 ] 6; 
		n               n     [ 0 0  0 0 0 0 0 ] 5e-1; 
	}
//    transportModel  Newtonian;
//    nu              nu [ 0 2 -1 0 0 0 0 ] 1e-04;
//    rho             rho [ 1 -3 0 0 0 0 0 ] 300;
//    CrossPowerLawCoeffs
//    {
//        nu0             nu0 [ 0 2 -1 0 0 0 0 ] 1e-04;
//        nuInf           nuInf [ 0 2 -1 0 0 0 0 ] 1e-04;
//        m               m [ 0 0 1 0 0 0 0 ] 1;
//        n               n [ 0 0 0 0 0 0 0 ] 0;
//    }
//
//    BirdCarreauCoeffs
//    {
//        nu0             nu0 [ 0 2 -1 0 0 0 0 ] 0.0142515;
//        nuInf           nuInf [ 0 2 -1 0 0 0 0 ] 1e-04;
//        k               k [ 0 0 1 0 0 0 0 ] 99.6;
//        n               n [ 0 0 0 0 0 0 0 ] 0.1003;
//    }
}

air
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 1.48e-05;
    rho             rho [ 1 -3 0 0 0 0 0 ] 1;
    CrossPowerLawCoeffs
    {
        nu0             nu0 [ 0 2 -1 0 0 0 0 ] 1e-06;
        nuInf           nuInf [ 0 2 -1 0 0 0 0 ] 1e-06;
        m               m [ 0 0 1 0 0 0 0 ] 1;
        n               n [ 0 0 0 0 0 0 0 ] 0;
    }

    BirdCarreauCoeffs
    {
        nu0             nu0 [ 0 2 -1 0 0 0 0 ] 0.0142515;
        nuInf           nuInf [ 0 2 -1 0 0 0 0 ] 1e-06;
        k               k [ 0 0 1 0 0 0 0 ] 99.6;
        n               n [ 0 0 0 0 0 0 0 ] 0.1003;
    }
}

sigma           sigma [ 1 0 -2 0 0 0 0 ] 0;


// ************************************************************************* //
